#### BuiltInFailures.DecalFailures Members

---

|  |
| --- |
| BuiltInFailures DecalFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures DecalFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotPaste | Can't place Decal at new position. |
| Public property Static member | LongerThanPossible | Decal element is longer than the circumference of the surface. |
| Public property Static member | OutsideHost | Decal does not lie on host. |

# See Also

BuiltInFailures DecalFailures Class

Autodesk.Revit.DB Namespace